na_hypo = ["ضعف عضلانی", "بی‌حسی", "آریتمی"]
na_hyper = ["ضعف عضلانی", "بی‌حسی", "آریتمی"]

k_hypo = ["ضعف عضلانی", "بی‌حسی", "آریتمی"]
k_hyper = ["گرفتگی عضلانی", "ضعف", "خستگی", "یبوست", "آریتمی قلبی"]

ca_hypo = ["گرفتگی عضلانی", "بی‌حسی", "سوزن‌سوزن شدن", "تشنج", "اسپاسم"]
ca_hyper = ["خستگی", "تشنگی", "تکرر ادرار", "تهوع", "یبوست", "گیجی"]

mg_hypo = ["لرزش", "گرفتگی عضلانی", "تشنج", "آریتمی", "اضطراب"]
mg_hyper = ["ضعف", "خواب‌آلودگی", "کاهش رفلکس‌ها", "افت فشار خون"]

cl_hypo = ["تهوع", "استفراغ", "ضعف عضلانی", "تنفس غیرطبیعی"]
cl_hyper = ["ضعف", "تشنگی", "تنفس سریع", "فشار خون بالا"]

p_hypo = ["ضعف", "درد استخوانی", "گیجی", "مشکلات تنفسی"]
p_hyper = ["خارش", "درد مفصلی", "ضعف عضلانی"]

common_symptoms = {
    "ضعف عضلانی": ["هیپوناترمی", "هیپرناترمی", "هیپوکالمی", "هیپرکالمی", "هیپرمنیزیمی", "هیپوکلرمی", "هیپرفسفاتمی", "هیپوفسفاتمی"],
    "بی‌حسی": ["هیپوناترمی", "هیپرناترمی", "هیپوکالمی", "هیپرکالمی", "هیپوکلسمی"]
    }